app/Controllers/CosechaController.php

    public function index()
    {
        $model = new CosechaModel();

        // Trae datos combinados de las otras tablas para mostrar nombres
        $data['cosechas'] = $model
            ->select('cosechas.*, parcelas.nombre AS parcela, tipos_uva.nombre AS tipo_uva, estado_sanitario.estado AS estado')
            ->join('parcelas', 'parcelas.id = cosechas.id_parcela')
            ->join('tipos_uva', 'tipos_uva.id = cosechas.id_tipo_uva')
            ->join('estado_sanitario', 'estado_sanitario.id = cosechas.id_estado_sanitario')
            ->orderBy('fecha_cosecha', 'DESC')
            ->findAll();
---
SELECT `cosechas`.*, `parcelas`.`nombre` AS `parcela`, `tipos_uva`.`nombre` AS `tipo_uva`, `estado_sanitario`.`estado` AS `estado`
FROM `cosechas`
JOIN `parcelas` ON `parcelas`.`id` = `cosechas`.`id_parcela`
JOIN `tipos_uva` ON `tipos_uva`.`id` = `cosechas`.`id_tipo_uva`
JOIN `estado_sanitario` ON `estado_sanitario`.`id` = `cosechas`.`id_estado_sanitario`
ORDER BY `fecha_cosecha` DESC