app/Controllers/EstadoSanitarioController.php

    public function index()
    {
        $model = new EstadoSanitarioModel();
        $data['estados'] = $model
            ->select('estado_sanitario.*, parcelas.nombre AS parcela')
            ->join('parcelas', 'parcelas.id = estado_sanitario.parcela_id')
            ->orderBy('fecha', 'DESC')
            ->findAll();
---
SELECT `estado_sanitario`.*, `parcelas`.`nombre` AS `parcela`
FROM `estado_sanitario`
JOIN `parcelas` ON `parcelas`.`id` = `estado_sanitario`.`parcela_id`
ORDER BY `fecha` DESC