app/Controllers/Parcelas.php

    public function index()
    {
        $model = new ParcelaModel();
        $data['parcelas'] = $model->findAll();
---
SELECT *
FROM `parcelas`